{
    "content_fields": [
        [
            null,
            null,
            [
                {
                    "desc": "**Required.** A user-readable string which represents the user who has been invited. This should not contain the user's third party ID, as otherwise when the invite is accepted it would leak the association between the matrix ID and the third party ID.",
                    "key": "display_name",
                    "required": true,
                    "title": "string"
                },
                {
                    "desc": "**Required.** A URL which can be fetched, with querystring public_key=public_key, to validate whether the key has been revoked. The URL must return a JSON object containing a boolean property named 'valid'.",
                    "key": "key_validity_url",
                    "required": true,
                    "title": "string"
                },
                {
                    "desc": "**Required.** A base64-encoded ed25519 key with which token must be signed (though a signature from any entry in public_keys is also sufficient). This exists for backwards compatibility.",
                    "key": "public_key",
                    "required": true,
                    "title": "string"
                },
                {
                    "desc": "Keys with which the token may be signed.",
                    "key": "public_keys",
                    "required": false,
                    "title": "[PublicKeys]"
                }
            ]
        ],
        [
            "PublicKeys",
            null,
            [
                {
                    "desc": "An optional URL which can be fetched, with querystring public_key=public_key, to validate whether the key has been revoked. The URL must return a JSON object containing a boolean property named 'valid'. If this URL is absent, the key must be considered valid indefinitely.",
                    "key": "key_validity_url",
                    "required": false,
                    "title": "string"
                },
                {
                    "desc": "**Required.** A base-64 encoded ed25519 key with which token may be signed.",
                    "key": "public_key",
                    "required": true,
                    "title": "string"
                }
            ]
        ]
    ],
    "desc": "Acts as an ``m.room.member`` invite event, where there isn't a target user_id to invite. This event contains a token and a public key whose private key must be used to sign the token. Any user who can present that signature may use this invitation to join the target room.",
    "msgtype": null,
    "title": "An invitation to a room issued to a third party identifier, rather than a matrix user ID.",
    "type": "m.room.third_party_invite",
    "type_with_msgtype": null,
    "typeof": "State Event",
    "typeof_info": "``state_key``: The token, of which a signature must be produced in order to join the room."
}